# FamilyLoadedIntoDocumentEventArgs Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FamilyLoadedIntoDocumentEventArgs Properties
FamilyLoadedIntoDocumentEventArgs Class See Also
---
The FamilyLoadedIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| Document | The document associated with the event.  (Inherited from RevitAPIPostDocEventArgs.) |
| FamilyName | The file name of the family that is loaded into the document. |
| FamilyPath | The file path of the family that is loaded into the document. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| NewFamilyId | The newly loaded family id. |
| OriginalFamilyId | The original family id that is overridden by the newly loaded family. |
| Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).  (Inherited from RevitAPIPostEventArgs.) |

# See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace